Тестирование ПО «Отделение полиции»
Исполнитель: Мельников Иван Дмитриевич
Дата 19.05.2024

Тест 1
Название	Тест_АВТОРИЗ_1
Важность	Высокая
Краткое описание	Проверка окна авторизации, проверка вводимых данных на пустоту
Шаги	Оставить поля логина и пароля пустыми и нажать на кнопку «Войти»
Вводимые данные 	------
Ожидаемый результат	Должно появится сообщение «Заполните все поля!»
Фактический результат	Появилось сообщение «Заполните все поля!»
Статус	Зачет


Оглавление
1.	Требования к оборудованию	3
2.	Необходимые программные средства	4
3.	Установка и первый запуск информационной системы	5


 
1.	Требования к оборудованию

Для работы с информационной системой «Треки» нужен персональный компьютер со следующими характеристиками:
•	Процессор с тактовой частотой 1,8 ГГц или выше;
•	2 Гб ОЗУ или выше;
•	800 Мб постоянной памяти или выше;
•	Монитор с разрешением 1280x720 или выше;
•	Клавиатура;
•	Мышь.
 
2.	Необходимые программные средства

Для установки и работы с информационной системой «Треки» могут потребоваться следующие программные средства:
•	ОС Windows 10 или выше;
•	Microsoft Visual Studio или выше;
•	Microsoft SQL Server Management Studio;
•	7Zip или другая программа для работы в «zip» ахривами.
 
3.	Установка и первый запуск информационной системы

Для установки и первого запуска информационной системы «Треки» необходимо выполнить следующие шаги:
1.	Скачать файл «tracks.zip» с официального сайта или с flash накопителя;
2.	Открыть файл «tracks.zip» с помощью 7Zip или другой программы для работы с архивами;
3.	Распаковать содержание архива в необходимый каталог;
4.	Открыть этот каталог «RockProj.exe».
Готово, программа установлена и запущена.
